//  7年级 下册 政治
const PROPERTY_LawProblems = [
    {
        q: "$INP#是人身体发育的重要时期，这一时期有生理变化。",
        a: ["青春期"],
    },
    {
        q: "我们要积极面对青春期心理$INP#和$INP#。",
        a: ["矛盾", "困惑"],
    },
    {
        q: "青春期要注重$INP#和$INP#，提升内在美。",
        a: ["品德", "文化修养"],
    },
    {
        q: "$INP#让我们感受到旺盛的生命力，让身体充满能量。",
        a: ["生理变化"],
    },
    {
        q: "伴随着生理变化，$INP#也在发生变化。",
        a: ["心理"],
    },
    {
        q: "正确对待生理变化。不因自己的生理变化$INP#，不$INP#他人的生理变化。",
        a: ["焦虑自卑", "嘲弄"],
    },
    {
        q: "在异性面前，我们有表现自己的$INP#。",
        a: ["欲望"],
    },
    {
        q: "男生女生各具$INP#，各有$INP#。",
        a: ["特点", "优势"],
    },
    {
        q: "男生女生的$INP#是与生俱来的。",
        a: ["生理性别"],
    },
    {
        q: "男生女生进入青春期，$INP#更加明显。",
        a: ["生理差异"],
    },
    {
        q: "男生女生的在$INP#、$INP#、$INP#等方面会表现出各自的特点。",
        a: ["性格特征", "兴趣爱好", "思维方式"],
    },
    {
        q: "异性间要$INP#、$INP#、$INP#，让自己变得更加优秀。",
        a: ["相互学习", "相互欣赏", "取长补短"],
    },
    {
        q: "与异性交往对我们的成长有$INP#极作用。",
        a: ["积"],
    },
    {
        q: "与异性$INP#地合作有助于$INP#。",
        a: ["完善自身", "友好坦然"],
    },
    {
        q: "萌发对异性的$INP#，因为对异性的欣赏、对未来的向往而感到$INP#，容易把这种欣赏和向往当作$INP#。",
        a: ["朦胧情感", "愉悦", "爱情"],
    },
    {
        q: "异性交往要把握好$INP#。",
        a: ["尺度"],
    },
    {
        q: "真正的爱情，不仅意味着$INP#、$INP#和$INP#，而且需要$INP#、$INP#和$INP#。",
        a: ["热烈的情感", "彼此的欣赏", "尊重", "责任", "能力", "担当"],
    },
    {
        q: "对于真正的爱情，我们要$INP#，$INP#。",
        a: ["慎重对待", "理智处理"],
    },
    {
        q: "随着身体的$INP#，我们逐渐走向性成熟。",
        a: ["发育"],
    },
    {
        q: "性成熟后，我们会对性产生$INP#，也会产生$INP#。",
        a: ["好奇", "困惑"],
    },
    {
        q: "走向性成熟，便要求我们了解$INP#，树立正确的$INP#。",
        a: ["性知识", "性观念"],
    },
    {
        q: "我们应当通过$INP#获取性知识。",
        a: ["正规途径"],
    },
    {
        q: "我们应当$INP#，言谈举止不$INP#。",
        a: ["自重自爱", "越界"],
    },
];

// Unsuccessful...
const PROPERTY_ChiProblems = [
    {
        q: "观沧海-曹操${BR}${TAB}东临碣石，$INP#。${BR}${TAB}$INP#，山岛竦峙。",
        a: ["以观沧海", "水何澹澹"],
    },
    {
        q: "观沧海-曹操${BR}${TAB}$INP#，以观沧海。${BR}${TAB}水何澹澹，$INP#。",
        a: ["东临碣石", "山岛竦峙"],
    },
    {
        q: "观沧海-曹操${BR}${TAB}树木丛生，$INP#。${BR}${TAB}$INP#，洪波涌起。",
        a: ["百草丰茂", "秋风萧瑟"],
    },
    {
        q: "观沧海-曹操${BR}${TAB}$INP#，百草丰茂。${BR}${TAB}秋风萧瑟，$INP#。",
        a: ["树木丛生", "洪波涌起"],
    },
    {
        q: "观沧海-曹操${BR}${TAB}$INP#，若出其中；$INP#，若出其里。${BR}${TAB}幸甚至哉，$INP#。",
        a: ["日月之行", "星汉灿烂", "歌以咏志"],
    },
    {
        q: "观沧海-曹操${BR}${TAB}日月之行，$INP#；星汉灿烂，$INP#。${BR}${TAB}$INP#，歌以咏志。",
        a: ["若出其中", "若出其里", "幸甚至哉"],
    },
];
